# PHASE - 2

## SQL Queries

In [1]:
import sqlite3
import pandas as pd
import numpy as np

In [4]:
df=pd.read_csv('Booking_Data.csv',index_col=0)

In [5]:
df.columns

Index(['sno', 'hotel_name', 'cities', 'location', 'number_of_reviews',
       'user_ratings', 'star_rating', 'review_score', 'free_wifi',
       'family_rooms', 'non_smoking_rooms', 'Restaurant', 'Bar', 'Heating',
       'Lift', 'breakfast_cuisine1', 'breakfast_cuisine2',
       'breakfast_cuisine3', 'room_type', 'single_bed', 'double_bed',
       'Prices'],
      dtype='object')

In [6]:
# Now we wil make three different dataframes from which we will make three tables on which we will do some queries

In [7]:
Data1=df[['sno','hotel_name','cities','location','number_of_reviews','user_ratings','star_rating','review_score']]

In [8]:
Data1.to_csv('Data1.csv')

In [9]:
Data2=df[['sno','hotel_name','free_wifi',
       'family_rooms', 'non_smoking_rooms', 'Restaurant', 'Bar', 'Heating',
       'Lift', 'breakfast_cuisine1', 'breakfast_cuisine2',
       'breakfast_cuisine3']]

In [10]:
Data2.to_csv('Data2.csv')

In [11]:
Data3=df[['sno','hotel_name','room_type', 'single_bed', 'double_bed',
       'Prices']]

In [12]:
Data3.to_csv('Data3.csv')

In [13]:
db=sqlite3.connect('database.db')

In [14]:
cursor=db.cursor()

In [10]:
cursor.execute("CREATE TABLE Table1(sno INTEGER PRIMARY KEY,hotel_name TEXT,cities TEXT,location TEXT,number_of_reviews INT,user_ratings INT,star_rating INT,review_score INT)")

In [ ]:
with open('Data1.csv','r')as file:
    no_records=0
    for row in file:
        cursor.execute("INSERT INTO Table2 VALUES(?,?,?,?,?,?,?,?)",row.split(","))
        db.commit()
        no_records+=1

print(no_records)

In [ ]:
cursor.execute("CREATE TABLE Table2(sno INTEGER PRIMARY KEY,hotel_name TEXT,cities TEXT,location TEXT,number_of_reviews INT,user_ratings INT,star_rating INT,review_score INT)")

In [ ]:
with open('Data2.csv','r')as file:
    no_records=0
    for row in file:
        cursor.execute("INSERT INTO Table2 VALUES(?,?,?,?,?,?,?,?)",row.split(","))
        db.commit()
        no_records+=1

print(no_records)

In [ ]:
cursor.execute("CREATE TABLE Table3(sno INTEGER PRIMARY KEY,hotel_name TEXT,cities TEXT,location TEXT,number_of_reviews INT,user_ratings INT,star_rating INT,review_score INT)")

In [ ]:
with open('Data3.csv','r')as file:
    no_records=0
    for row in file:
        cursor.execute("INSERT INTO Table3 VALUES(?,?,?,?,?,?,?,?)",row.split(","))
        db.commit()
        no_records+=1

print(no_records)

In [ ]:
Table 1



1)     1  Write a query to give  details of hotels city is Sydney and  ratings is more than 5.



2)   2   Write a query  to find the location with the most reviews.



3)  3     Write a  query that  will retrieve all rows and sort them in descending order of user ratings.



4)   4   Write a query that  retrieves rows where the star rating is greater than or equal to 4.0 and sorts them in descending order of review score.



5)    5   Write a query to count the number of hotels in each city.

In [ ]:
#1
result=cursor.execute("SELECT*FROM Table1 WHERE cities='Sydney'AND user_ratings>5")
for row in result :
    print(row)

In [ ]:
#2
result=cursor.execute("SELECT locatin,MAX(number_of_reviews)AS most_reviews From Table1")
for row in result :
    print(row)

In [ ]:
#3
result=cursor.execute("SELECT*FROM Table1 ORDER BY user_ratings DESC")
for row in result :
    print(row)

In [ ]:
#4
result=cursor.execute("SELECT*FROM Table1 Where star_ratings>=4.0 ORDER BY review_score DESC")
for row in result :
    print(row)

In [ ]:
#5
result=cursor.execute("SELECT cities,COUNT(*) AS number_of_hotels FROM Table1 Group BY cities")
for row in result :
    print(row)

In [ ]:
Table 2



1)   1   Write a query to retrieve hotels that have both a restaurant and a bar



2)    2  Write a query to retrieve hotels that offer free WiFi and have family rooms.



3)  3     Write a query to count the occurrences of each breakfast cuisine type.



4)    4   Write a query to retrieve hotels that offer a certain(CONTINENTAL )  breakfast cuisine .{{Students you may give any cuisine as per your choices}}



5)    5   Write a query to see whether an hotel has all amenities such as Heating, Lift and Bar.

In [ ]:
#1
result=cursor.execute("SELECT*FROM Table2 WHERE Restaurant='Yes' AND BAR='Yes'")
for row in result :
    print(row)

In [ ]:
#2
result=cursor.execute("SELECT*FROM Table2 WHERE free_wifi='Yes'AND family_rooms='Yes'")
for row in result :
    print(row)

In [ ]:
#3
result=cursor.execute("SELECT [breakfast_cuisine1]AS Cuisine,COUNT(*)AS Count From Table2 UNION 
                      SELECT[breakfast_cuisine2]AS Cisine,Count(*)AS COunt From Table2 UNION
                      SELECT[breakfast_cuisine3]AS Cisine,Count(*)AS COunt From Table2")
for row in result :
    print(row)

In [ ]:
#4
result=cursor.execute("SELECT*FROM Table2 WHERE [breakfast_cusine1]='CONTINENTAL'OR
                      [breakfast_cusine2]='CONTINENTAL' OR [breakfast_cusine3]='CONTINENTAL'")
for row in result :
    print(row)

In [ ]:
#5
result=cursor.execute("SELECT*FROM Table2 Where Heating='Yes' AND Lift='Yes'AND Bar='Yes'")
for row in result :
    print(row)

In [ ]:
Table 3 :



1)    1  Write SQL query to retrieve hotels that offer double bed rooms and sort them by price in descending order.



2)    2   Write a SQL query to calculate the average price for each room type.


From here we will be making SUBQUERIES including the data

 from table 1/Table 2/Table 3


    
3)  3     Write a query to find details of hotels with user ratings above 5 as a  threshold and that offer free WiFi. (Use table 1 and table 2)



4)  4    Write a query to find hotels that offer both family rooms and non-smoking rooms(Use table 1 and Table 2)


5)   5    Write a query to calculate the average price for each room type (Use table2 and Table 3)

In [ ]:
#1
result=cursor.execute("SELECT*FROM Table3 WHERE[Room_type]='Double bed' ORDER BY Prices DESC")
for row in result :
    print(row)

In [ ]:
#2
result=cursor.execute("SELECT[Room_type],AVG(Prices)AS AveragePrice FROM Table3 GROUP BY [Room_type]")
for row in result :
    print(row)

In [ ]:
#3
result=cursor.execute("SELECT T1*FROM Table1 JOIN Table2 T2 ON T1.[hotel_name]=T2.[hotel_name] Where T1.user_ratings>
                      5 AND T2.[free_wifi]='Yes'")
for row in result :
    print(row)

In [ ]:
#4
result=cursor.execute("SELECT T1*FROM Table1 T1 JOIN Table2 T2 ON T1.[hotel_name]=T2.[hotel_name]
                      WHERE T2.[Family_rooms]='Yes' AND T2.[Non_smoking_rooms]='Yes'")
for row in result :
    print(row)

In [ ]:
#5
result=cursor.execute("SELECT D3.[Room_type],AVG(D3.Prices) AS AveragePrice From Table2 T2 JOIN
                      Table3 D3 ON T2.[hotel_name]=D3.[Hotel_name] GROUP BY D3.[Room_type]")
for row in result :
    print(row)